Courses/7370/Lectures/Overview/andrews-multithreaded-toc.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-12-09 Mon 05:12 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Foundations &#x2026; Gregory R. Andrews TOC</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Prabhaker Mateti" />
<meta name="description" content="WSU CEG 7370 Distributed Computing"
 />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../"> UP </a>
 |
 <a accesskey="H" href="../../Top/index.html"> HOME </a>
</div><div id="preamble" class="status">
2019-12-09 | <a href="../../">../../</a>
</div>
<div id="content">
<h1 class="title">Foundations &#x2026; Gregory R. Andrews TOC</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgabb4b60">1. TOC</a></li>
<li><a href="#org0a1929d">2. Part 0. The Concurrent Computing Landscape.</a></li>
<li><a href="#org82a571a">3. Part I. SHARED VARIABLE PROGRAMMING.</a>
<ul>
<li><a href="#org2c7733f">3.1. 2. Processes and Synchronization.</a></li>
<li><a href="#orge602451">3.2. 3. Locks and Barriers.</a></li>
<li><a href="#org28f4e9f">3.3. 4. Semaphores.</a></li>
<li><a href="#org78fff7e">3.4. 5. Monitors.</a></li>
<li><a href="#org2f61f26">3.5. 6. Implementations.</a></li>
</ul>
</li>
<li><a href="#orgb68b9b0">4. Part II. DISTRIBUTED PROGRAMMING.</a>
<ul>
<li><a href="#orgf0e689c">4.1. 7. Message Passing.</a></li>
<li><a href="#org5d8c85a">4.2. 8. RPC and Rendezvous.</a></li>
<li><a href="#orgd6fb3db">4.3. 9. Paradigms for Process Interaction.</a></li>
<li><a href="#orgdcd20c6">4.4. 10. Implementations.</a></li>
<li><a href="#orgbd1c9cd">4.5. 11. Scientific Computing.</a></li>
<li><a href="#org164ead2">4.6. 12. Languages, Compilers, Libraries, and Tools.</a></li>
</ul>
</li>
<li><a href="#org15f53df">5. End</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgabb4b60" class="outline-2">
<h2 id="orgabb4b60"><span class="section-number-2">1</span> TOC</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li>Foundations of Multithreaded, Parallel, and Distributed Programming
/ Edition 1 by Gregory R. Andrews</li>
</ol>
</div>
</div>

<div id="outline-container-org0a1929d" class="outline-2">
<h2 id="org0a1929d"><span class="section-number-2">2</span> Part 0. The Concurrent Computing Landscape.</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li>The Essence of Concurrent Programming.</li>
<li>Hardware Architectures.</li>
<li>Single Processor Machines.</li>
<li>Shared-Memory Multiprocessors.</li>
<li>Multicomputers Networks.</li>
<li>Applications and Programming Styles.</li>
<li>Iterative Parallelism: Matrix Multiplication.</li>
<li>Recursive Parallelism: Adaptive Quadrature.</li>
<li>Producers and Consumers: Unix Pipes.</li>
<li>Clients and Servers: Remote Files.</li>
<li>Peers: Distributed Matrix Multiplication.</li>
<li>Summary of Programming Notation.</li>
<li>Declarations Sequential Statements.</li>
<li>Concurrent Statements and Process Declarations.</li>
<li>Comments.</li>
</ol>
</div>
</div>

<div id="outline-container-org82a571a" class="outline-2">
<h2 id="org82a571a"><span class="section-number-2">3</span> Part I. SHARED VARIABLE PROGRAMMING.</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org2c7733f" class="outline-3">
<h3 id="org2c7733f"><span class="section-number-3">3.1</span> 2. Processes and Synchronization.</h3>
<div class="outline-text-3" id="text-3-1">
<ol class="org-ol">
<li>States, Actions, Histories, and Properties.</li>
<li>Parallelization: Finding Patterns in Files.</li>
<li>Synchronization: The Maximum of an Array.</li>
<li>Atomic Actions and Await Statements.</li>
<li>Fine-Grained Atomicity.</li>
<li>Specifying Synchronization: The Await Statement.</li>
<li>Finding Patterns in a File Revisited.</li>
<li>A Synopsis of Axiomatic Semantics.</li>
<li>Formal Logical Systems.</li>
<li>A Programming Logic.</li>
<li>Semantics of Concurrent Execution.</li>
<li>Techniques for Avoiding Interference.</li>
<li>Disjoint Variables Weakened Assertions.</li>
<li>Global Invariants.</li>
<li>Synchronization.</li>
<li>An Example: The Array Copy Problem Revisited.</li>
<li>Safety and Liveness Properties.</li>
<li>Proving Safety Properties.</li>
<li>Scheduling Policies and Fairness.</li>
</ol>
</div>
</div>

<div id="outline-container-orge602451" class="outline-3">
<h3 id="orge602451"><span class="section-number-3">3.2</span> 3. Locks and Barriers.</h3>
<div class="outline-text-3" id="text-3-2">
<ol class="org-ol">
<li>The Critical Section Problem.</li>
<li>Critical Sections: Spin Locks.</li>
<li>Test and Set.</li>
<li>Test and Test and Set.</li>
<li>Implementing Await Statements.</li>
<li>Critical Sections: Fair Solutions.</li>
<li>The Tie-Breaker Algorithm.</li>
<li>The Ticket Algorithm.</li>
<li>The Bakery Algorithm.</li>
<li>Barrier Synchronization.</li>
<li>Shared Counter.</li>
<li>Flags and Coordinators.</li>
<li>Symmetric Barriers.</li>
<li>Data Parallel Algorithms.</li>
<li>Parallel Prefix Computations.</li>
<li>Operations on Linked Lists.</li>
<li>Grid Computations: Laplace's Equation.</li>
<li>Synchronous Multiprocessors.</li>
<li>Parallel Computing with a Bag of Tasks.</li>
<li>Matrix Multiplication.</li>
<li>Adaptive Quadrature.</li>
</ol>
</div>
</div>

<div id="outline-container-org28f4e9f" class="outline-3">
<h3 id="org28f4e9f"><span class="section-number-3">3.3</span> 4. Semaphores.</h3>
<div class="outline-text-3" id="text-3-3">
<ol class="org-ol">
<li>Syntax and Semantics.</li>
<li>Basic Problems and Techniques.</li>
<li>Critical Sections: Mutual Exclusion.</li>
<li>Barriers: Signaling Events.</li>
<li>Producers and Consumers: Split Binary Semaphores.</li>
<li>Bounded Buffers: Resource Counting.</li>
<li>The Dining Philosophers.</li>
<li>Readers and Writers.</li>
<li>Readers/Writers as an Exclusion Problem.</li>
<li>Readers/Writers Using Condition Synchronization.</li>
<li>The Technique of Passing the Baton.</li>
<li>Alternative Scheduling Policies.</li>
<li>Resource Allocation and Scheduling.</li>
<li>Problem Definition and General Solution Pattern.</li>
<li>Shortest-Job-Next Allocation.</li>
<li>Case Study: Pthreads.</li>
<li>Thread Creation.</li>
<li>Semaphores.</li>
<li>Example: A Simple Producer and Consumer.</li>
</ol>
</div>
</div>

<div id="outline-container-org78fff7e" class="outline-3">
<h3 id="org78fff7e"><span class="section-number-3">3.4</span> 5. Monitors.</h3>
<div class="outline-text-3" id="text-3-4">
<ol class="org-ol">
<li>Syntax and Semantics.</li>
<li>Mutual Exclusion.</li>
<li>Condition Variables.</li>
<li>Signaling Disciplines.</li>
<li>Additional Operations on Condition Variables.</li>
<li>Synchronization Techniques.</li>
<li>Bounded Buffers: Basic Condition Synchronization.</li>
<li>Readers and Writers: Broadcast Signal.</li>
<li>Shortest-Job-Next Allocation: Priority Wait.</li>
<li>Interval Timer: Covering Conditions.</li>
<li>The Sleeping Barber: Rendezvous.</li>
<li>Disk Scheduling: Program Structures.</li>
<li>Scheduler as a Separate Monitor.</li>
<li>Scheduler as an Intermediary.</li>
<li>Scheduler as a Nested Monitor.</li>
<li>Case Study: Java.</li>
<li>The Threads Class.</li>
<li>Synchronized Methods.</li>
<li>Parallel Readers/Writers.</li>
<li>Exclusive Readers/Writers.</li>
<li>True Readers/Writers.</li>
<li>Case Study: Pthreads.</li>
<li>Locks and Condition Variables.</li>
<li>Example: Summing the Elements of a Matrix.</li>
</ol>
</div>
</div>

<div id="outline-container-org2f61f26" class="outline-3">
<h3 id="org2f61f26"><span class="section-number-3">3.5</span> 6. Implementations.</h3>
<div class="outline-text-3" id="text-3-5">
<ol class="org-ol">
<li>A Single-Processor Kernel.</li>
<li>A Multiprocessor Kernel.</li>
<li>Implementing Semaphores in a Kernel.</li>
<li>Implementing Monitors in a Kernel.</li>
<li>Implementing Monitors Using Semaphores.</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-orgb68b9b0" class="outline-2">
<h2 id="orgb68b9b0"><span class="section-number-2">4</span> Part II. DISTRIBUTED PROGRAMMING.</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orgf0e689c" class="outline-3">
<h3 id="orgf0e689c"><span class="section-number-3">4.1</span> 7. Message Passing.</h3>
<div class="outline-text-3" id="text-4-1">
<ol class="org-ol">
<li>Asynchronous Message Passing.</li>
<li>Filters: A Sorting Network.</li>
<li>Clients and Servers.</li>
<li>Active Monitors.</li>
<li>A Self-Scheduling Disk Driver.</li>
<li>File Servers: Conversational Continuity.</li>
<li>Interacting Peers: Exchanging Values.</li>
<li>Synchronous Message Passing.</li>
<li>Case Study: CSP.</li>
<li>Communication Statements.</li>
<li>Guarded Communication.</li>
<li>Example: The Sieve of Eratosthenes.</li>
<li>Case Study: Linda.</li>
<li>Tuple Space and Process Interaction.</li>
<li>Example: Prime Numbers with a Bag of Tasks.</li>
<li>Case Study: MPI.</li>
<li>Basic Functions.</li>
<li>Global Communication and Synchronization.</li>
<li>Case Study: Java.</li>
<li>Networks and Sockets.</li>
<li>Example: A Remote File Reader.</li>
</ol>
</div>
</div>

<div id="outline-container-org5d8c85a" class="outline-3">
<h3 id="org5d8c85a"><span class="section-number-3">4.2</span> 8. RPC and Rendezvous.</h3>
<div class="outline-text-3" id="text-4-2">
<ol class="org-ol">
<li>Remote Procedure Call.</li>
<li>Synchronization in Modules.</li>
<li>A Time Server Caches in a Distributed File System.</li>
<li>A Sorting Network of Merge Filters.</li>
<li>Interacting Peers: Exchanging Values.</li>
<li>Rendezvous.</li>
<li>Input Statements.</li>
<li>Client/Server Examples.</li>
<li>A Sorting Network of Merge Filters.</li>
<li>Interacting Peers: Exchanging Values.</li>
<li>A Multiple Primitives Notation.</li>
<li>Invoking and Servicing Operations.</li>
<li>Examples.</li>
<li>Readers/Writers Revisited.</li>
<li>Encapsulated Access.</li>
<li>Replicated Files.</li>
<li>Case Study: Java.</li>
<li>Remote Method Invocation.</li>
<li>Example: A Remote Database.</li>
<li>Case Study: Ada.</li>
<li>Tasks.</li>
<li>Rendezvous.</li>
<li>Protected Types.</li>
<li>Example: The Dining Philosophers.</li>
<li>Case Study: SR.</li>
<li>Resources and Globals.</li>
<li>Communication and Synchronization.</li>
<li>Example: Critical Section Simulation.</li>
</ol>
</div>
</div>

<div id="outline-container-orgd6fb3db" class="outline-3">
<h3 id="orgd6fb3db"><span class="section-number-3">4.3</span> 9. Paradigms for Process Interaction.</h3>
<div class="outline-text-3" id="text-4-3">
<ol class="org-ol">
<li>Managers/Workers (Distributed Bag of Tasks).</li>
<li>Sparse Matrix Multiplication.</li>
<li>Adaptive Quadrature Revisited.</li>
<li>Heartbeat Algorithms.</li>
<li>Image Processing: Region Labeling.</li>
<li>Cellular Automata: The Game of Life.</li>
<li>Pipeline Algorithms.</li>
<li>A Distributed Matrix Multiplication Pipeline.</li>
<li>Matrix Multiplication by Blocks.</li>
<li>Probe/Echo Algorithms.</li>
<li>Broadcast in a Network.</li>
<li>Computing the Topology of a Network.</li>
<li>Broadcast Algorithms.</li>
<li>Logical Clocks and Event Ordering.</li>
<li>Distributed Semaphores.</li>
<li>Token-Passing Algorithms.</li>
<li>Distributed Mutual Exclusion.</li>
<li>Termination Detection in a Ring.</li>
<li>Termination Detection in a Graph.</li>
<li>Replicated Servers.</li>
<li>Distributed Dining Philosophers.</li>
<li>Decentralized Dining Philosophers.</li>
</ol>
</div>
</div>

<div id="outline-container-orgdcd20c6" class="outline-3">
<h3 id="orgdcd20c6"><span class="section-number-3">4.4</span> 10. Implementations.</h3>
<div class="outline-text-3" id="text-4-4">
<ol class="org-ol">
<li>Asynchronous Message Passing.</li>
<li>Shared-Memory Kernel.</li>
<li>Distributed Kernel.</li>
<li>Synchronous Message Passing.</li>
<li>Direct Communication Using Asynchronous Messages.</li>
<li>Guarded Communication Using a Clearing House.</li>
<li>RPC and Rendezvous.</li>
<li>RPC in a Kernel.</li>
<li>Rendezvous Using Asynchronous Message Passing.</li>
<li>Multiple Primitives in a Kernel.</li>
<li>Distributed Shared Memory.</li>
<li>Implementation Overview.</li>
<li>Page Consistency Protocols.</li>
<li>* Part III. PARALLEL PROGRAMMING:</li>
<li>Speedup and Efficiency.</li>
<li>Overheads and Challenges.</li>
</ol>
</div>
</div>

<div id="outline-container-orgbd1c9cd" class="outline-3">
<h3 id="orgbd1c9cd"><span class="section-number-3">4.5</span> 11. Scientific Computing.</h3>
<div class="outline-text-3" id="text-4-5">
<ol class="org-ol">
<li>Grid Computations.</li>
<li>Laplace's Equation.</li>
<li>Sequential Jacobi Iteration.</li>
<li>Shared Variable Program.</li>
<li>Message Passing Program.</li>
<li>Red/Black Successive Over Relaxation.</li>
<li>Multigrid Methods.</li>
<li>Particle Computations.</li>
<li>The Gravitational #N-Body Problem.</li>
<li>Shared Variable Program.</li>
<li>Message Passing Programs.</li>
<li>Approximate Methods.</li>
<li>Matrix Computations.</li>
<li>Gaussian Elimination.</li>
<li>LU Decomposition.</li>
<li>Shared Variable Program.</li>
<li>Message Passing Program.</li>
</ol>
</div>
</div>

<div id="outline-container-org164ead2" class="outline-3">
<h3 id="org164ead2"><span class="section-number-3">4.6</span> 12. Languages, Compilers, Libraries, and Tools.</h3>
<div class="outline-text-3" id="text-4-6">
<ol class="org-ol">
<li>Parallel Programming Libraries.</li>
<li>Case Study: Pthreads.</li>
<li>Case Study: MPI.</li>
<li>Case Study: OpenMP.</li>
<li>Parallelizing Compilers.</li>
<li>Dependence Analysis.</li>
<li>Program Transformations.</li>
<li>Other Programming Models.</li>
<li>Imperative Languages.</li>
<li>Coordination Languages Data Parallel Languages.</li>
<li>Functional Languages.</li>
<li>Abstract Models.</li>
<li>Case Study: High Performance Fortran (HPF).</li>
<li>Parallel Programming Tools.</li>
<li>Performance Measurement and Visualization.</li>
<li>Metacomputers and Metacomputing.</li>
<li>Case Study: The Globus Toolkit. 0201357526T04062001</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org15f53df" class="outline-2">
<h2 id="org15f53df"><span class="section-number-2">5</span> End</h2>
<div class="outline-text-2" id="text-5">
</div>
</div>
</div>
<div id="postamble" class="status">
<hr size=1>Copyright &copy; 2016 &bull; <a href="http://www.wright.edu/~pmateti">www.wright.edu/~pmateti</a> &bull; 2019-12-09
</div>
</body>
</html>
